Revit 2027 API
BuiltInFailures.CreationFailures.CannotMakeRoofFromVerticalFaceError Property
 Can't make roof from vertical face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMakeRoofFromVerticalFaceError { get; }
Public Shared ReadOnly Property CannotMakeRoofFromVerticalFaceError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMakeRoofFromVerticalFaceError {
	FailureDefinitionId^ get ();
}
static member CannotMakeRoofFromVerticalFaceError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace